/*
*dа се напише рекурзивна функција sumEven која ќе ја пресмета сумата на сите парни позитивни броеви помали или еднакви на даден број.
Од стандарден влез да се прочита еден цел број и да се испечати сумата на сите парни позитивни броеви помали од вчитаниот број.
Објаснување за примерот.
Влез:
11
Излез:
30 (Позитивни парни броеви помали од 11 се 10,8,6,4,2 чија што сума е 30)
 **/
#include<iostream>
using namespace std;
int sumEven(int n) {
 if (n==0) {
  return 0;
 }
 if (n%2==0) {
  return n+sumEven(n-1);

 }
 return sumEven(n-1);
}
int main() {
 int n;
 cin>>n;
 cout<<sumEven(n-1)<<endl;

}